[GraphicalObject]
Name=wls
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgwls|dgChangeDiagHelpIndex INSTPANEL| "

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=logbook   ,  IMAGESET   ,hpgbut02.dll
3=temp      ,  IMAGESET   ,hpgbut02.dll
4=method    ,  IMAGESET   ,hpgbut02.dll
5=valve     ,  IMAGESET   ,hpgbut02.dll
6=needle    ,  IMAGESET   ,hpgbut02.dll
7=metering  ,  IMAGESET   ,hpgbut02.dll
8=transport ,  IMAGESET   ,hpgbut02.dll
9=peripump  ,  IMAGESET   ,hpgbut02.dll
10=wtray  ,  IMAGESET   ,hpgbut02.dll
11=aitray , IMAGESET ,hpgbut02.dll


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel wls
Help=機器パネルのトップレベルへの切替


[IMAGESET logbook]
x=455
y=9
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "WLSlogbook"|サンプラ/インジェクタ ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "WLSlogbook"|サンプラ/インジェクタ ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=109
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "WLStemp"|サンプラ/インジェクタ温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "WLStemp"|サンプラ/インジェクタ温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=59
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "WLSmethod"|サンプラ/インジェクタ メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "WLSmethod"|サンプラ/インジェクタ メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET valve]
x=318
y=112
width=56
height=49
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dginjv1|BMP.dginjv1|BMP.dginjv1|@view.floatingmenu "DiagGuiReg[4]", "WLSvalve"|ウェルプレート サンプラ/インジェクタ インジェクション バルブ
set1= BMP.dginjv2|BMP.dginjv2|BMP.dginjv2|@view.floatingmenu "DiagGuiReg[4]", "WLSvalve"|ウェルプレート サンプラ/インジェクタ インジェクション バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET needle]
x=198
y=53
width=73
height=92
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgndl_01|BMP.dgndl_01|BMP.dgndl_01|@view.floatingmenu "DiagGuiReg[4]", "WLSneedle"|ウェルプレート サンプラ/インジェクタ ニードル/シート
set1= BMP.dgndl_02|BMP.dgndl_02|BMP.dgndl_02|@view.floatingmenu "DiagGuiReg[4]", "WLSneedle"|ウェルプレート サンプラ/インジェクタ ニードル/シート
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET metering]
x=310
y=5
width=110
height=39
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgmedev1|BMP.dgmedev1|BMP.dgmedev1|@view.floatingmenu "DiagGuiReg[4]", "WLSmetering"|ウェルプレート サンプラ/インジェクタ サンプル ユニット
set1= BMP.dgmedev2|BMP.dgmedev2|BMP.dgmedev2|@view.floatingmenu "DiagGuiReg[4]", "WLSmetering"|ウェルプレート サンプラ/インジェクタ サンプル ユニット
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET transport]
x=59
y=26
width=112
height=63
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgspltr1|BMP.dgspltr1|BMP.dgspltr1|@view.floatingmenu "DiagGuiReg[4]", "WLStransport"|ウェルプレート サンプラ/インジェクタ サンプル トランスポート
set1= BMP.dgspltr2|BMP.dgspltr2|BMP.dgspltr2|@view.floatingmenu "DiagGuiReg[4]", "WLStransport"|ウェルプレート サンプラ/インジェクタ サンプル トランスポート
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET peripump]
x=166
y=147
width=77
height=58
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgwspmp1|BMP.dgwspmp1|BMP.dgwspmp1|@view.floatingmenu "DiagGuiReg[4]", "WLSperipump"|ウェルプレート サンプラ/インジェクタ ペリスタリック ポンプ
set1= BMP.dgwspmp2|BMP.dgwspmp2|BMP.dgwspmp2|@view.floatingmenu "DiagGuiReg[4]", "WLSperipump"|ウェルプレート サンプラ/インジェクタ ペリスタリック ポンプ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET wtray]
x=39
y=96
width=125
height=112
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgwtray1|BMP.dgwtray1|BMP.dgwtray1|@view.floatingmenu "DiagGuiReg[4]", "WLSWTray"|ウェルプレート サンプラ/インジェクタ冷却 サンプル トレイ
set1= BMP.dgwtray2|BMP.dgwtray2|BMP.dgwtray2|@view.floatingmenu "DiagGuiReg[4]", "WLSWTray"|ウェルプレート サンプラ/インジェクタ冷却 サンプル トレイ
set2= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray||
set3= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "WLSAITray"|ウェルプレート サンプラ/オートメーション インターフェース
set4= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "WLSAITray"|ウェルプレート サンプラ/オートメーション インターフェース

Help=""


[IMAGESET aitray]
x=39
y=96
width=125
height=112
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "WLSAITray"|ウェルプレート サンプラ/オートメーション インターフェース
set1= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "WLSAITray"|ウェルプレート サンプラ/オートメーション インターフェース
set2= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "WLSAITray"|ウェルプレート サンプラ/オートメーション インターフェース
set0= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "WLSAITray"|ウェルプレート サンプラ/オートメーション インターフェース
Help=""
